[
  {
    "title": "Clean",
    "year": 2022,
    "cast": [
      "Adrien Brody",
      "Glenn Fleshler",
      "Mykelti Williamson",
      "RZA"
    ],
    "genres": [
      "Action",
      "Thriller"
    ],
    "href": "Clean_(2021_film)",
    "extract": "Clean is a 2021 American action thriller film directed by Paul Solet and starring Adrien Brody, who also produced and wrote the film.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b4/Clean_%282021_film%29.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Homeroom",
    "year": 2021,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Homeroom_(2021_film)",
    "extract": "Homeroom is a 2021 American documentary film directed and produced by Peter Nicks. The film, which is the final chapter of Nicks' Oakland trilogy, follows the lives of the Oakland High School class of 2020 as they try to make the most of their final year in high school amidst district budget cuts and ultimately the COVID-19 pandemic and the George Floyd protests. Ryan Coogler and Davis Guggenheim, the latter of whom made a similar film, Waiting for \"Superman\", were executive producers on this film.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/81/Homeroom_Sundance_poster_2021.png",
    "thumbnail_width": 260,
    "thumbnail_height": 384
  },
  {
    "title": "Never Rarely Sometimes Always",
    "year": 2020,
    "cast": [
      "Sidney Flanigan",
      "Talia Ryder",
      "Theodore Pellerin",
      "Ryan Eggold",
      "Sharon Van Etten"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Never_Rarely_Sometimes_Always",
    "extract": "Never Rarely Sometimes Always is a 2020 drama film written and directed by Eliza Hittman. It stars Sidney Flanigan, Talia Ryder, Théodore Pellerin, Ryan Eggold, and Sharon Van Etten. It had its world premiere at the Sundance Film Festival on January 24, 2020. It was also selected to compete for the Golden Bear in the main competition section at the 70th Berlin International Film Festival, where it won the Silver Bear Grand Jury Prize. The film was released in the United States on March 13, 2020, by Focus Features. It received widespread acclaim from critics, with praise for Flanigan's performance and Hittman's direction.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/44/Never_Rarely_Sometimes_Always.png",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Ticket to Paradise",
    "year": 2022,
    "cast": [
      "George Clooney",
      "Julia Roberts",
      "Kaitlyn Dever",
      "Billie Lourd",
      "Maxime Bouttier",
      "Lucas Bravo"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "Ticket_to_Paradise_(2022_film)",
    "extract": "Ticket to Paradise is a 2022 romantic comedy film starring George Clooney and Julia Roberts as a divorced couple who team up to sabotage the impending wedding of their daughter in Bali. The film is directed by Ol Parker and written by Parker and Daniel Pipski, while Kaitlyn Dever, Billie Lourd, Maxime Bouttier, and Lucas Bravo also star.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e8/Ticket_to_Paradise_poster.jpg",
    "thumbnail_width": 250,
    "thumbnail_height": 396
  },
  {
    "title": "Without Remorse",
    "year": 2021,
    "cast": [
      "Michael B. Jordan",
      "Jamie Bell",
      "Jodie Turner-Smith",
      "Lauren London",
      "Brett Gelman",
      "Jacob Scipio",
      "Jack Kesy",
      "Colman Domingo",
      "Guy Pearce"
    ],
    "genres": [
      "Action",
      "Thriller"
    ],
    "href": "Without_Remorse_(film)",
    "extract": "Without Remorse is a 2021 American action thriller film based on the 1993 novel of the same name by Tom Clancy. It is directed by Stefano Sollima and written by Taylor Sheridan and Will Staples, and stars Michael B. Jordan, Jamie Bell, Jodie Turner-Smith, Luke Mitchell, Jack Kesy, Brett Gelman, Lauren London, Colman Domingo and Guy Pearce. The plot follows John Kelly, a U.S. Navy SEAL who sets out on a path of revenge after his pregnant wife and unit members are killed by Russian hitmen.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/Without_Remorse_poster.jpg",
    "thumbnail_width": 250,
    "thumbnail_height": 370
  },
  {
    "title": "Summerland",
    "year": 2020,
    "cast": [
      "Gemma Arterton",
      "Gugu Mbatha-Raw",
      "Penelope Wilton",
      "Tom Courtenay"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Summerland_(2020_film)",
    "extract": "Summerland is a 2020 British drama film written and directed by Jessica Swale, starring Gemma Arterton, Gugu Mbatha-Raw, Lucas Bond, Dixie Egerickx, Siân Phillips, Penelope Wilton and Tom Courtenay.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2c/Summerland_2020_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 163
  },
  {
    "title": "Valley Girl",
    "year": 2020,
    "cast": [
      "Jessica Rothe",
      "Josh Whitehouse",
      "Mae Whitman",
      "Judy Greer"
    ],
    "genres": [
      "Comedy",
      "Musical",
      "Teen",
      "Romance"
    ],
    "href": "Valley_Girl_(2020_film)",
    "extract": "Valley Girl is a 2020 American jukebox musical romantic comedy teen film directed by Rachel Lee Goldenberg and written by Amy Talkington from a story by Wayne Crawford and Andrew Lane. It is a remake of the 1983 film of the same name and stars Jessica Rothe, Josh Whitehouse, Mae Whitman, and Judy Greer. The film follows Julie Richman, a Valley girl, who falls in love with Randy, a rebellious punk, during the early 1980s.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/d7/Valley_Girl_2020_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "Crisis",
    "year": 2021,
    "cast": [
      "Gary Oldman",
      "Armie Hammer",
      "Evangeline Lilly",
      "Greg Kinnear",
      "Michelle Rodriguez",
      "Luke Evans",
      "Lily-Rose Depp",
      "Scott Mescudi",
      "Martin Donovan"
    ],
    "genres": [
      "Crime",
      "Thriller"
    ],
    "href": "Crisis_(2021_film)",
    "extract": "Crisis is a 2021 crime thriller film written, produced and directed by Nicholas Jarecki. The film’s ensemble cast includes Gary Oldman, Armie Hammer, Evangeline Lilly, Greg Kinnear, Michelle Rodriguez, Luke Evans, Lily-Rose Depp, Kid Cudi, and Martin Donovan.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/30/Crisis_poster.jpeg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "The Stand In",
    "year": 2020,
    "cast": [
      "Drew Barrymore",
      "Michael Zegen",
      "T.J. Miller",
      "Holland Taylor"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "The_Stand_In_(2020_film)",
    "extract": "The Stand In is a 2020 American romantic comedy film directed by Jamie Babbit, written by Sam Bain, and starring Drew Barrymore, Michael Zegen, T.J. Miller and Holland Taylor. It was released on December 11, 2020.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/82/The_Stand-In.jpg",
    "thumbnail_width": 267,
    "thumbnail_height": 373
  },
  {
    "title": "God's Time",
    "year": 2023,
    "cast": [
      "Ben Groh",
      "Dion Costelloe",
      "Liz Caribel Sierra"
    ],
    "genres": [],
    "href": null
  },
  {
    "title": "Don't Tell a Soul",
    "year": 2021,
    "cast": [
      "Jack Dylan Grazer",
      "Fionn Whitehead",
      "Rainn Wilson",
      "Mena Suvari"
    ],
    "genres": [
      "Thriller"
    ],
    "href": "Don%27t_Tell_a_Soul_(film)",
    "extract": "Don't Tell a Soul is a 2020 American thriller film written and directed by Alex McAulay, in his directorial debut. It stars Rainn Wilson as a security guard who gets trapped in a hole chasing two teens who stole $12,000, and must barter for his life; Mena Suvari also stars.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/94/DontTellASoul.jpeg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "Awake",
    "year": 2021,
    "cast": [
      "Gina Rodriguez",
      "Jennifer Jason Leigh",
      "Barry Pepper",
      "Finn Jones",
      "Gil Bellows"
    ],
    "genres": [
      "Science Fiction",
      "Thriller"
    ],
    "href": "Awake_(2021_film)",
    "extract": "Awake is a 2021 American science fiction thriller film, directed by Mark Raso, from a screenplay he wrote alongside Joseph Raso. It stars Gina Rodriguez, Jennifer Jason Leigh, Barry Pepper, Finn Jones, Shamier Anderson, Ariana Greenblatt, Frances Fisher, Elias Edraki, Lucius Hoyos and Gil Bellows.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4e/Awake_%282021_film%29_Official_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Slumberland",
    "year": 2022,
    "cast": [
      "Jason Momoa",
      "Marlow Barkley",
      "Chris O'Dowd",
      "Kyle Chandler",
      "Weruche Opia"
    ],
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "href": "Slumberland_(film)",
    "extract": "Slumberland is a 2022 American fantasy adventure film directed by Francis Lawrence and written by David Guion and Michael Handelman. Based on the comic strip Little Nemo in Slumberland by Winsor McCay, the film stars Jason Momoa, Marlow Barkley, Chris O'Dowd, Kyle Chandler, and Weruche Opia. It tells the story of a young girl who goes to live with her uncle after her father is lost at sea and enters Slumberland where she befriends a renegade character who is involved in a plot to get to the Sea of Nightmares and obtain a special pearl that may have the power to reunite her with her father.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/77/Slumberland_%28film%29.jpg",
    "thumbnail_width": 250,
    "thumbnail_height": 370
  },
  {
    "title": "The Little Mermaid",
    "year": 2023,
    "cast": [
      "Halle Bailey",
      "Jonah Hauer-King",
      "Daveed Diggs",
      "Awkwafina",
      "Jacob Tremblay",
      "Noma Dumezweni",
      "Javier Bardem",
      "Melissa McCarthy"
    ],
    "genres": [
      "Fantasy",
      "Musical"
    ],
    "href": "The_Little_Mermaid_(2023_film)",
    "extract": "The Little Mermaid is an upcoming American musical fantasy film directed by Rob Marshall from a screenplay written by David Magee. It is a live-action adaptation of Disney's 1989 animated film of the same name, which itself is loosely based on the 1837 fairy tale of the same title by Hans Christian Andersen. The film stars Halle Bailey in the titular role, Jonah Hauer-King, Daveed Diggs, Awkwafina, Jacob Tremblay, Noma Dumezweni, Javier Bardem, and Melissa McCarthy.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f4/The_Little_Mermaid_%282023_film%29.png",
    "thumbnail_width": 260,
    "thumbnail_height": 385
  },
  {
    "title": "Space Jam: A New Legacy",
    "year": 2021,
    "cast": [
      "LeBron James",
      "Don Cheadle",
      "Khris Davis",
      "Sonequa Martin-Green",
      "Cedric Joe",
      "Jeff Bergman",
      "Eric Bauza",
      "Zendaya"
    ],
    "genres": [
      "Live Action",
      "Animated",
      "Comedy",
      "Sports"
    ],
    "href": "Space_Jam:_A_New_Legacy",
    "extract": "Space Jam: A New Legacy is a 2021 American live-action/animated sports comedy film co-produced by Warner Animation Group, Proximity Media, and The SpringHill Company, and distributed by Warner Bros. Pictures. The film was directed by Malcolm D. Lee from a screenplay by Juel Taylor, Tony Rettenmaier, Keenan Coogler, Terence Nance, Jesse Gordon, and Celeste Ballard, and a story by Taylor, Rettenmaier, Coogler, and Nance. It serves as a standalone sequel to Space Jam (1996) and is the first theatrically released film to feature the Looney Tunes characters since Looney Tunes: Back in Action (2003). The film stars basketball player LeBron James as a fictional version of himself; Don Cheadle, Khris Davis, Sonequa Martin-Green and Cedric Joe star in live-action roles, while Jeff Bergman, Eric Bauza and Zendaya headline the Looney Tunes voice cast. The film follows James enlisting the Looney Tunes' aid to win a basketball game in a Warner Bros.-themed virtual multiverse against a rogue artificial intelligence's avatars after James's son is abducted by the AI.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b7/SpaceJamANewLegacyOfficialPoster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Bloodshot",
    "year": 2020,
    "cast": [
      "Vin Diesel",
      "Eiza González",
      "Sam Heughan",
      "Toby Kebbell",
      "Lamorne Morris",
      "Guy Pearce"
    ],
    "genres": [
      "Superhero"
    ],
    "href": "Bloodshot_(film)",
    "extract": "Bloodshot is a 2020 American superhero film based on the Valiant Comics character of the same name. It is intended to be the first installment in a series of films set within a Valiant Comics shared cinematic universe. Directed by David S. F. Wilson from a screenplay by Jeff Wadlow and Eric Heisserer and a story by Wadlow, the film stars Vin Diesel in the main role, Eiza González, Sam Heughan, Toby Kebbell, and Guy Pearce. It follows a soldier who was killed in action, only to be brought back to life with superpowers by an organization that wants to use him as a weapon.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/45/Bloodshot_-_official_film_poster.jpeg",
    "thumbnail_width": 220,
    "thumbnail_height": 316
  },
  {
    "title": "Home Sweet Home Alone",
    "year": 2021,
    "cast": [
      "Ellie Kemper",
      "Rob Delaney",
      "Archie Yates",
      "Aisling Bea",
      "Pete Holmes",
      "Kenan Thompson",
      "Ally Maki",
      "Chris Parnell"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "Home_Sweet_Home_Alone",
    "extract": "Home Sweet Home Alone is a 2021 American Christmas comedy film directed by Dan Mazer, written by Mikey Day and Streeter Seidell, and starring Ellie Kemper, Rob Delaney, Archie Yates, Aisling Bea, Kenan Thompson, Pete Holmes, Ally Maki, and Chris Parnell. The sixth film in the Home Alone franchise, Home Sweet Home Alone was produced by 20th Century Studios as an original title for Disney+, the first 20th Century Studios film to be produced for the streaming service. The film was announced after The Walt Disney Company acquired 21st Century Fox and inherited the rights to the Home Alone franchise.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dc/Home_Sweet_Home_Alone_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Rent-A-Pal",
    "year": 2020,
    "cast": [
      "Wil Wheaton",
      "Brian Landis Folkins",
      "Kathleen Brady",
      "Amy Rutledge",
      "Adrian Egolf"
    ],
    "genres": [
      "Thriller"
    ],
    "href": "Rent-A-Pal",
    "extract": "Rent-A-Pal is a 2020 American thriller film written and directed by Jon Stevenson, produced by J.D. Lifshitz, Brian Landis Folkins, Jon Stevenson, Annie Elizabeth Baker, Jimmy Weber, Robert B. Martin Jr., Brandon Fryman and Raphael Margules. It stars Wil Wheaton, Brian Landis Folkins, Kathleen Brady, Amy Rutledge, and Adrian Egolf.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/38/Rent_a_pal_xlg.jpg",
    "thumbnail_width": 258,
    "thumbnail_height": 387
  },
  {
    "title": "Death of Me",
    "year": 2020,
    "cast": [
      "Maggie Q",
      "Alex Essoe",
      "Luke Hemsworth"
    ],
    "genres": [
      "Horror"
    ],
    "href": "Death_of_Me_(film)",
    "extract": "Death of Me is a 2020 American horror film, directed by Darren Lynn Bousman, from a screenplay by Arli Margolis, James Morley III and David Tish. It stars Maggie Q, Alex Essoe, and Luke Hemsworth.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2d/Death_of_Me_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Show Me the Father",
    "year": 2021,
    "cast": [
      "Sherman Smith",
      "Tony Evans",
      "Steven Kendrick",
      "Alex Kendrick",
      "Deland McCullough",
      "Jim Daly",
      "Eddie George"
    ],
    "genres": [
      "Documentary"
    ],
    "href": "Show_Me_the_Father",
    "extract": "Show Me the Father is a 2021 American Christian documentary film by director Rick Altizer, presenting five fatherhood-related stories connected with commentary by Tony Evans, produced by Mark Miller and executive produced by the Kendrick brothers. It is the Kendrick brothers' seventh film and their third through their subsidiary, Kendrick Brothers Productions. It was theatrically released on September 10, 2021.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/87/Show_Me_the_Father_Promotional_Poster.jpg",
    "thumbnail_width": 261,
    "thumbnail_height": 381
  }
]